app/views/tours/_form.html.erb

SELECT `tours`.* FROM `tours`
---
    <%= form.label :status %>
    <%= form.select :status, options_for_select(Tour.statuses.values.to_a, :selected => Tour.statuses[tour.status]), {}, :id => "tour-status-select" %>