app/views/tours/index.html.erb

SELECT `tours`.* FROM `tours`
---
    <h4><b><u>Itinerary</u></b></h4>
    <% @filter.tour_locations.each do |itinerary| %>