app/views/tours/show.html.erb

SELECT `tour_locations`.* FROM `tour_locations` WHERE `tour_locations`.`tour_id` = 12
---

  <% @tour.tour_locations.each do |loc| %>