app/views/tours/show_search.html.erb

      <%= location.label :state_or_province, "State/Province" %>
      <%= location.select :state_or_province, options_for_select(TourLocation.distinct.pluck(:state_or_province)), include_blank: true %>
---
SELECT DISTINCT `tour_locations`.`state_or_province` FROM `tour_locations`

      <%= location.label :country, "Country" %>
      <%= location.select :country, options_for_select(TourLocation.distinct.pluck(:country)), include_blank: true %>
---
SELECT DISTINCT `tour_locations`.`country` FROM `tour_locations`