app/views/tours/show.html.erb

      </thead>
      <% @tour.users.each do |user| %>
---
SELECT `users`.* FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 7