app/controllers/reviews_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`tour_id` = 12
---
    def set_reviews
      if params[:my_reviews] == "true"
        if current_user.role == "agent"
          redirect_to home_url, notice: "Agents cannot create or modify reviews"
        end
        # this shows reviews#index view
        user_id = current_user.id
        @reviews = Review.where(user_id: user_id)
        @title_message = "My Reviews for Completed Tours"
      elsif params[:tour_id]
        tour_id = params[:tour_id]
        @reviews = Review.where(tour_id: tour_id)