app/controllers/reviews_controller.rb

  def new
    if current_user.role != "agent"
      user_id = current_user.id
      user_tours = current_user.user_tours.select {|x| x.user_id == user_id}
      @completed_tours = user_tours.map { |ut| Tour.where(id: ut[:tour_id], status: "Completed")}
---
SELECT  `user_tours`.* FROM `user_tours` WHERE `user_tours`.`tour_id` = 12 AND `user_tours`.`user_id` = 10 LIMIT 1
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 12 AND `tours`.`status` = 'Completed' LIMIT 1

  def create
    if current_user.role != "agent"
      @review = Review.new(review_params)
      respond_to do |format|
        if @review.save
---
INSERT INTO `reviews` (`subject`, `message`, `created_at`, `updated_at`, `user_id`, `tour_id`) VALUES ('European Tour Review', 'This tour was great!', '2019-02-22 15:36:53', '2019-02-22 15:36:53', 10, 12)

  def update
    if current_user.role != "agent"
      respond_to do |format|
        if @review.update(review_params)
---
UPDATE `reviews` SET `message` = 'It was just ok.', `updated_at` = '2019-02-25 03:11:15' WHERE `reviews`.`id` = 2

    def set_review
      @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1

    def set_reviews
      if params[:my_reviews] == "true"
        user_id = current_user.id
        @reviews = Review.where(user_id: user_id)
        @title_message = "My Reviews for Completed Tours"
      else
        @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 10
SELECT `reviews`.* FROM `reviews`