app/controllers/tours_controller.rb

  def show
    # If a user_tours record exists for this tour and this user, send it to the show view
    @user_tour_rec = UserTour.find_by('user_id': current_user.id, 'tour_id': @tour.id)
---
SELECT  `user_tours`.* FROM `user_tours` WHERE `user_tours`.`user_id` = 10 AND `user_tours`.`tour_id` = 12 LIMIT 1