app/controllers/tours_controller.rb

  def index
    if params[:search]
      @page_title = "List of Tours from filter"
      # function located above...
      search_results = search()
      @tours = search_results[0]
      @filter = search_results[1]
    else
      personalize = params[:my_tours]
      bookmarked_tours = params[:bookmarked_tours]
      waitlisted_tours = params[:waitlisted_tours]

      if personalize
        if %w[admin agent].include?(current_user.role)
          @tours = current_user.tours
          @page_title = "My Tours"
        elsif current_user.role.eql? 'customer'
          booked_user_tours = current_user.user_tours.select {|x| x.booked? || x.wait_listed?}
          @tours = booked_user_tours.map {|ut| Tour.find(ut[:tour_id])}
---
SELECT `tours`.* FROM `tours` INNER JOIN `user_tours` ON `tours`.`id` = `user_tours`.`tour_id` WHERE `user_tours`.`user_id` = 2
SELECT `users`.* FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 12
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 12 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1

  def create
    # if image(s) attached they will be found inside tour_params
    @tour = Tour.new(tour_params)

    respond_to do |format|
      if @tour.save
---
INSERT INTO `tours` (`name`, `description`, `created_at`, `updated_at`, `price`, `booking_deadline`, `from_date`, `to_date`, `total_seats`, `op_email`, `op_phone`, `status`) VALUES ('Bill Mwaniki', '', '2019-02-16 16:02:11', '2019-02-16 16:02:11', 1.01, '2019-02-16 16:01:00', '2019-02-16', '2019-02-16', 1, 'bnmwaniki@icloud.com', '', 'In Future')

  def update

    respond_to do |format|
      # if image(s) attached they will be found inside tour_params
      if @tour.update(tour_params)
---
UPDATE `tours` SET `status` = 'Cancelled', `updated_at` = '2019-02-17 18:37:12' WHERE `tours`.`id` = 11

  def destroy
    if params[:picture_id]
      delete_picture(params[:picture_id])
      respond_to do |format|
        format.html { redirect_to tour_url(@tour.id), notice: 'Image was successfully destroyed.' }
        format.json { head :no_content }
      end
    else
      @tour.destroy
---
DELETE FROM `user_tours` WHERE `user_tours`.`tour_id` = 11

  def update_booking
    @tour.update_booking(current_user, params[:cancel_seats].to_i)
---
UPDATE `user_tours` SET `num_booked` = 0, `booked` = FALSE, `wait_listed` = FALSE, `num_wait_listed` = 0, `updated_at` = '2019-02-21 17:38:29' WHERE `user_tours`.`id` = 828

    def set_tour
      @tour = Tour.find(params[:id])
---
SELECT  `tours`.* FROM `tours` WHERE `tours`.`id` = 12 LIMIT 1

    def find_tours_from_search(tour)
      query = Tour.joins(:tour_locations).distinct
      query = query.status(tour.status) if tour.status.present?
      query = query.where("name LIKE ?", "%#{tour.name}%") if tour.name.present?
      query = query.price(tour.price) if tour.price.present?
      query = query.from_date(tour.from_date) if tour.from_date.present?
      query = query.to_date(tour.to_date) if tour.to_date.present?
      query = query.where(tour_locations: {state_or_province: params[:tour]["tour_locations_attributes"]["0"]["state_or_province"]}) if params[:tour]["tour_locations_attributes"]["0"]["state_or_province"].present?
      query = query.where(tour_locations: {country: params[:tour]["tour_locations_attributes"]["1"]["country"]}) if params[:tour]["tour_locations_attributes"]["1"]["country"].present?

      return query.all
---
SELECT `tour_locations`.* FROM `tour_locations` WHERE `tour_locations`.`tour_id` = 3 AND `tour_locations`.`id` IN (1, 2, 3, 4, 5)
SELECT `tours`.* FROM `tours` WHERE `tours`.`status` = 'In Future' AND `tours`.`status` = 'KJwe' AND `tours`.`status` = 23.0 AND `tours`.`status` = '2018-06-08 08:08:00' AND `tours`.`status` = '2020-08-08' AND `tours`.`status` = '2017-09-10' AND `tours`.`status` = 6 AND `tours`.`status` IN (SELECT `tour_locations`.`id` FROM `tour_locations` WHERE `tour_locations`.`tour_id` IS NULL AND (1=0))
SELECT `tours`.* FROM `tours` WHERE `tours`.`name` = 'jh'
SELECT DISTINCT `tours`.* FROM `tours` INNER JOIN `tour_locations` ON `tour_locations`.`tour_id` = `tours`.`id` WHERE `tour_locations`.`state_or_province` = 'north carolina'
SELECT `tour_locations`.* FROM `tour_locations` WHERE `tour_locations`.`country` = 'USA' AND `tour_locations`.`state_or_province` = 'NC'
SELECT `tours`.* FROM `tours` INNER JOIN `tour_locations` ON `tour_locations`.`tour_id` = `tours`.`id` WHERE `tours`.`name` = 'ksdjf' AND `tours`.`price` = 23.0 AND `tours`.`from_date` = '2018-04-04' AND `tour_locations`.`country` = 'USA'
SELECT DISTINCT `tour_locations`.`state_or_province` FROM `tour_locations`