app/controllers/tours_controller.rb

  def bookmark
    @tour = Tour.find(params[:tour_id])
    @tour.users << current_user unless @tour.users.include? current_user
    user_tour = UserTour.find_by('user_id': current_user.id, 'tour_id': @tour.id)
    user_tour[:bookmarked] = true
    user_tour.save
---
INSERT INTO `user_tours` (`user_id`, `tour_id`, `created_at`, `updated_at`) VALUES (10, 12, '2019-02-18 09:34:17', '2019-02-18 09:34:17')
SELECT  1 AS one FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 12 AND `users`.`id` = 10 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 12
UPDATE `user_tours` SET `bookmarked` = TRUE, `updated_at` = '2019-02-18 11:13:59' WHERE `user_tours`.`id` = 828

  def undo_bookmark
    @tour = Tour.find(params[:tour_id])
    user_tour = UserTour.find_by('user_id': current_user.id, 'tour_id': @tour.id)
    user_tour[:bookmarked] = false
    user_tour.save
---
SELECT  `user_tours`.* FROM `user_tours` WHERE `user_tours`.`user_id` = 10 AND `user_tours`.`tour_id` = 12 LIMIT 1
UPDATE `user_tours` SET `bookmarked` = FALSE, `updated_at` = '2019-02-18 14:27:58' WHERE `user_tours`.`id` = 828

  def book
    tour = Tour.find(params[:tour_id])
    user_tour_hash = UserTour.get_user_tour_info(tour.id, current_user.id)
    seats_available = user_tour_hash[:seats_available]
    user_tour_rec = user_tour_has[:user_tour_rec]
    waitlist_seats = params[:waitlist_amt].to_i

    tour.users << current_user unless tour.users.include? current_user
---
INSERT INTO `user_tours` (`user_id`, `tour_id`, `created_at`, `updated_at`) VALUES (10, 14, '2019-02-22 16:19:18', '2019-02-22 16:19:18')
SELECT  1 AS one FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 12 AND `users`.`id` = 10 LIMIT 1
SELECT  `user_tours`.* FROM `user_tours` WHERE `user_tours`.`user_id` = 10 AND `user_tours`.`tour_id` = 12 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `user_tours` ON `users`.`id` = `user_tours`.`user_id` WHERE `user_tours`.`tour_id` = 12