app/controllers/users_controller.rb

  def index
    if current_user.role == "admin"
      @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = user_from_params

    if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `email`, `encrypted_password`, `remember_token`, `first_name`, `last_name`, `role`) VALUES ('2019-02-15 23:08:29', '2019-02-15 23:08:29', 'agent1@test.org', '$2a$10$abft0Hq8uvsJ/MRBKnusU.lu7ZjN4D4BLfFAmfqJXYLcMMUIYCJvO', '25d6f32cfa2c75d257e3ed9a9fde3ba3102e00fb', 'first', 'last', 'customer')

  def update
    @user = User.find(params[:id])
    puts user_params[:password]

    # for non admins, if password not set, then ignore it
    if user_params[:password] && user_params[:password].empty?
      temp_params = user_params.slice!(:email, :role, :first_name, :last_name)
    else
      temp_params = user_params
    end

    respond_to do |format|
      if @user.update_attributes(temp_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$10$fgLWWkquMnDaEG8Fp4yr6uWTnrivxYCXqFewV1hsV8Cph.EV1TRpW', `role` = 'customer', `updated_at` = '2019-02-16 18:43:32' WHERE `users`.`id` = 14

  def destroy
    @user = User.find(params[:id])
    # admin account cannot be deleted
    if @user.role == "admin" then return end

    if @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 15 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 15